spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_card/contains_an_error_message.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=6&card[exp_year]=2018&card[cvc]=314
    headers:
      accept:
      - "*/*; q=0.5, application/xml"
      accept-encoding:
      - gzip, deflate
      user-agent:
      - Stripe/v1 RubyBindings/1.22.0
      authorization:
      - Bearer sk_test_4RY761zzTqgVHQNB5ciHEW9X
      content-type:
      - application/x-www-form-urlencoded
      x-stripe-client-user-agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ryans-Air.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"Ryans-Air.local"}'
      content-length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      server:
      - nginx
      date:
      - Sun, 21 Jun 2015 12:27:12 GMT
      content-type:
      - application/json
      content-length:
      - '763'
      connection:
      - keep-alive
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - "*"
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_D7mJT9HaVIJDtyrJ
      stripe-version:
      - '2014-07-22'
      strict-transport-security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16G7XY4E0ggiBrh42XivV8kp",
          "livemode": false,
          "created": 1434889632,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16G7XY4E0ggiBrh41th4g1JS",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 6,
            "exp_year": 2018,
            "fingerprint": "jSAZR2hEKRYz14Hw",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": null
          },
          "client_ip": "111.80.191.172"
        }
    http_version: '1.1'
  recorded_at: Sun, 21 Jun 2015 12:36:49 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=300&currency=usd&source=tok_16G7XY4E0ggiBrh42XivV8kp
    headers:
      accept:
      - "*/*; q=0.5, application/xml"
      accept-encoding:
      - gzip, deflate
      user-agent:
      - Stripe/v1 RubyBindings/1.22.0
      authorization:
      - Bearer sk_test_4RY761zzTqgVHQNB5ciHEW9X
      content-type:
      - application/x-www-form-urlencoded
      x-stripe-client-user-agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ryans-Air.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"Ryans-Air.local"}'
      content-length:
      - '59'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      server:
      - nginx
      date:
      - Sun, 21 Jun 2015 12:27:14 GMT
      content-type:
      - application/json
      content-length:
      - '162'
      connection:
      - keep-alive
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - "*"
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_G06vahJEBhDp1Vao
      stripe-version:
      - '2014-07-22'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_16G7XZ4E0ggiBrh4awjupW4Q"
          }
        }
    http_version: '1.1'
  recorded_at: Sun, 21 Jun 2015 12:36:51 GMT
recorded_with: VCR 2.9.3
